In [1]:
import pandas as pd

In [4]:
names = ['Kanishka', 'Sahithi','Bansal', 'Sibi']
eng_marks = [100,56,33,78]
hindi_marks = [87,43,23,65]
science_marks = [93,71,56,32]
social_marks = [90,54,56,78]
d = {'Student_Name':names,'English':eng_marks, 'Hindi':hindi_marks,'Science':science_marks, 'Social':social_marks}
df = pd.DataFrame(data=d)

In [5]:
df

  Student_Name  English  Hindi  Science  Social
0     Kanishka      100     87       93      90
1      Sahithi       56     43       71      54
2       Bansal       33     23       56      56
3         Sibi       78     65       32      78

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.shape

(4, 5)

In [10]:
df

  Student_Name  English  Hindi  Science  Social
0     Kanishka      100     87       93      90
1      Sahithi       56     43       71      54
2       Bansal       33     23       56      56
3         Sibi       78     65       32      78

In [151]:
df = pd.read_csv("data/marks.csv")

In [152]:
df

       Name  English  Hindi  Science  Social
0  Kanishka       80     70       60      50
1   Sahithi       50     60       70      80
2     Amith       75     65       55      45
3      Sibi       85     75       65      55
4     Anand       75     20       24      34

In [153]:
#!pip install openpyxl

In [154]:
#df = pd.read_excel("data/marks.xlsx")
#df

In [155]:
df.values

array([['Kanishka', 80, 70, 60, 50],
       ['Sahithi', 50, 60, 70, 80],
       ['Amith', 75, 65, 55, 45],
       ['Sibi', 85, 75, 65, 55],
       ['Anand', 75, 20, 24, 34]], dtype=object)

In [156]:
type(df.values)

numpy.ndarray

In [157]:
df.dtypes

Name       object
English     int64
Hindi       int64
Science     int64
Social      int64
dtype: object

In [158]:
df.columns.tolist()

['Name', 'English', 'Hindi', 'Science', 'Social']

In [159]:
df.size

25

Retrieve Rows from Pandas DataFrame

In [160]:
df

       Name  English  Hindi  Science  Social
0  Kanishka       80     70       60      50
1   Sahithi       50     60       70      80
2     Amith       75     65       55      45
3      Sibi       85     75       65      55
4     Anand       75     20       24      34

In [161]:
df.at[2,'English']

75

In [162]:
df.iat[1,3]

70

In [163]:
df.loc[2]       # Row wise retrieval

Name       Amith
English       75
Hindi         65
Science       55
Social        45
Name: 2, dtype: object

In [164]:
df.loc[1:3]      #Label Based

      Name  English  Hindi  Science  Social
1  Sahithi       50     60       70      80
2    Amith       75     65       55      45
3     Sibi       85     75       65      55

In [165]:
df.iloc[2]

Name       Amith
English       75
Hindi         65
Science       55
Social        45
Name: 2, dtype: object

In [166]:
df1 = df.iloc[1:3]          #Slicing the Dataframe (Index Based)

In [167]:
df1

      Name  English  Hindi  Science  Social
1  Sahithi       50     60       70      80
2    Amith       75     65       55      45

Iterate over Pandas DataFrame

In [168]:
for i,r in df.iterrows():
    print("Index is: ",i, " The Row is: ",r['Name'])

Index is:  0  The Row is:  Kanishka
Index is:  1  The Row is:  Sahithi
Index is:  2  The Row is:  Amith
Index is:  3  The Row is:  Sibi
Index is:  4  The Row is:  Anand

In [169]:
def pass_fail_status(eng,hin,sci,soc):
    if((eng>=35) and (hin>=35) and (sci>=35) and (soc>=35)):
        return 'P'
    else:
        return 'F'

In [170]:
import time

In [171]:
start_for = time.time()
df['STATUS']='F'
for i,r in df.iterrows():
    df.at[i,'STATUS'] = pass_fail_status(r.English,r.Hindi,r.Science,r.Social)
end_for = time.time()
print("Total Time Taken By ForLoop: ", (end_for - start_for), "Seconds")
df

Total Time Taken By ForLoop:  0.004999876022338867 Seconds

       Name  English  Hindi  Science  Social STATUS
0  Kanishka       80     70       60      50      P
1   Sahithi       50     60       70      80      P
2     Amith       75     65       55      45      P
3      Sibi       85     75       65      55      P
4     Anand       75     20       24      34      F

In [172]:
df1 = pd.read_csv("data/marks.csv")

In [173]:
df1

       Name  English  Hindi  Science  Social
0  Kanishka       80     70       60      50
1   Sahithi       50     60       70      80
2     Amith       75     65       55      45
3      Sibi       85     75       65      55
4     Anand       75     20       24      34

In [174]:
start_lambda = time.time()
df1['STATUS'] = df1.apply(lambda r: pass_fail_status(r.English,r.Hindi,r.Science,r.Social), axis=1)
end_lambda = time.time()
print("Total Time Taken By Lambda Function to Execute: ",(end_lambda - start_lambda), "Seconds")

Total Time Taken By Lambda Function to Execute:  0.004999876022338867 Seconds

In [175]:
df1

       Name  English  Hindi  Science  Social STATUS
0  Kanishka       80     70       60      50      P
1   Sahithi       50     60       70      80      P
2     Amith       75     65       55      45      P
3      Sibi       85     75       65      55      P
4     Anand       75     20       24      34      F

Statistical Operations on Pandas DataFrame

In [176]:
df.English.mean()

73.0

In [177]:
df.English.mode()

0    75
Name: English, dtype: int64

In [178]:
df.English.max()

85

In [179]:
df.English.min()

50

Scalar Operations on Pandas DataFrame

In [180]:
df.Hindi = df.Hindi+5

In [181]:
#df['Hindi'] = df['Hindi']+5

In [182]:
#df.loc['Hindi'] = df['Hindi']+5

In [183]:
df['Hindi'] = df.apply(lambda r: ((r.Hindi)+5),axis=1)

In [184]:
df

       Name  English  Hindi  Science  Social STATUS
0  Kanishka       80     80       60      50      P
1   Sahithi       50     70       70      80      P
2     Amith       75     75       55      45      P
3      Sibi       85     85       65      55      P
4     Anand       75     30       24      34      F

Object Operations on Pandas DataFrame

In [185]:
names = pd.Series(['A','B','C','D'])
eng = pd.Series([60,70,80,90])
hin = pd.Series([70,30,20,10])
d = {'Name':names,'English':eng, 'Hindi':hin}
df1 = pd.DataFrame(data=d)
df1

  Name  English  Hindi
0    A       60     70
1    B       70     30
2    C       80     20
3    D       90     10

In [186]:
sci = pd.Series([650,40,60,70])
soc = pd.Series([40,70,40,50])
d1 = {'Science':sci,'Social':soc}
df2 = pd.DataFrame(data=d1)
df2

   Science  Social
0      650      40
1       40      70
2       60      40
3       70      50

In [187]:
#Horizontal Concatenation of DataFrames

In [188]:
df = pd.concat([df1,df2],axis=1)
df.shape

(4, 5)

In [189]:
names = pd.Series(['A','B','C','D'])
eng = pd.Series([60,70,80,90])
hin = pd.Series([70,30,20,10])
sci = pd.Series([650,40,60,70])
soc = pd.Series([40,70,40,50])
d2 = {'Name':names,'English':eng, 'Hindi':hin,'Science':sci,'Social':soc}
df3 = pd.DataFrame(data=d2)
df3

  Name  English  Hindi  Science  Social
0    A       60     70      650      40
1    B       70     30       40      70
2    C       80     20       60      40
3    D       90     10       70      50

In [190]:
df3.shape

(4, 5)

In [191]:
#Vertical Concatenation of DataFrames
df = pd.concat([df,df3],axis=0, ignore_index=True)
df.shape

(8, 5)

In [192]:
df

  Name  English  Hindi  Science  Social
0    A       60     70      650      40
1    B       70     30       40      70
2    C       80     20       60      40
3    D       90     10       70      50
4    A       60     70      650      40
5    B       70     30       40      70
6    C       80     20       60      40
7    D       90     10       70      50

In [194]:
names = pd.Series(['A','B','C','D'])
eng = pd.Series([60,70,80,90])
hin = pd.Series([70,30,20,10])
sci = pd.Series([50,40,60,70])
soc = pd.Series([40,70,40,50])
d2 = {'Name':names,'English':eng, 'Hindi':hin,'Science':sci,'Social':soc}
df1 = pd.DataFrame(data=d2)
df1

  Name  English  Hindi  Science  Social
0    A       60     70       50      40
1    B       70     30       40      70
2    C       80     20       60      40
3    D       90     10       70      50

In [195]:
names = pd.Series(['A','B','C','D'])
eng = pd.Series([60,70,80,90])
hin = pd.Series([70,30,20,10])
sci = pd.Series([650,40,60,70])
soc = pd.Series([40,70,40,50])
d2 = {'Name':names,'English':eng, 'Hindi':hin,'Science':sci,'Social':soc}
df2 = pd.DataFrame(data=d2)
df2

  Name  English  Hindi  Science  Social
0    A       60     70      650      40
1    B       70     30       40      70
2    C       80     20       60      40
3    D       90     10       70      50

In [200]:
df3 = df1+df2

In [201]:
df3

  Name  English  Hindi  Science  Social
0   AA      120    140      700      80
1   BB      140     60       80     140
2   CC      160     40      120      80
3   DD      180     20      140     100